#### Terraform Plan
<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_ecs_cluster.wordpress_cluster will be updated in-place
  ~ resource "aws_ecs_cluster" "wordpress_cluster" {
        id       = "arn:aws:ecs:eu-west-1:480391725083:cluster/raffaelesollecitowebsite_wordpress"
        name     = "raffaelesollecitowebsite_wordpress"
      ~ tags     = {
          - "AWS.SSM.AppManager.ECS.Cluster.ARN" = "arn:aws:ecs:eu-west-1:480391725083:cluster/raffaelesollecitowebsite_wordpress" -> null
        }
      ~ tags_all = {
          - "AWS.SSM.AppManager.ECS.Cluster.ARN" = "arn:aws:ecs:eu-west-1:480391725083:cluster/raffaelesollecitowebsite_wordpress" -> null
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_ecs_cluster_capacity_providers.wordpress_cluster will be created
  + resource "aws_ecs_cluster_capacity_providers" "wordpress_cluster" {
      + capacity_providers = [
          + "FARGATE_SPOT",
        ]
      + cluster_name       = "raffaelesollecitowebsite_wordpress"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE_SPOT"
          + weight            = 100
        }
    }

  # aws_ecs_service.wordpress_service will be updated in-place
  ~ resource "aws_ecs_service" "wordpress_service" {
        id                                 = "arn:aws:ecs:eu-west-1:480391725083:service/raffaelesollecitowebsite_wordpress/raffaelesollecitowebsite_wordpress"
        name                               = "raffaelesollecitowebsite_wordpress"
        tags                               = {}
      ~ task_definition                    = "raffaelesollecitowebsite_wordpress:15" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.wordpress_container must be replaced
-/+ resource "aws_ecs_task_definition" "wordpress_container" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:480391725083:task-definition/raffaelesollecitowebsite_wordpress:15" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:480391725083:task-definition/raffaelesollecitowebsite_wordpress" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "raffaelesollecitowebsite_wordpress" -> (known after apply)
      ~ revision                 = 15 -> (known after apply)
        tags                     = {
            "Name" = "raffaelesollecitowebsite_WordpressECS"
        }
        # (10 unchanged attributes hidden)

      - volume {
          - configure_at_launch = false -> null
          - name                = "raffaelesollecitowebsite_wordpress_persistent" -> null

          - efs_volume_configuration {
              - file_system_id          = "fs-09ff41364e1abdef3" -> null
              - root_directory          = "/" -> null
              - transit_encryption      = "ENABLED" -> null
              - transit_encryption_port = 0 -> null

              - authorization_config {
                  - access_point_id = "fsap-0466a8c7c60582901" -> null
                }
            }
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "raffaelesollecitowebsite_wordpress_persistent"

          + efs_volume_configuration {
              + file_system_id          = "fs-09ff41364e1abdef3"
              + root_directory          = "/"
              + transit_encryption      = "ENABLED"
              + transit_encryption_port = 0

              + authorization_config {
                  + access_point_id = "fsap-0466a8c7c60582901"
                }
            }
        }
    }

  # aws_rds_cluster.serverless_wordpress must be replaced
-/+ resource "aws_rds_cluster" "serverless_wordpress" {
      ~ allocated_storage                     = 1 -> (known after apply)
      + apply_immediately                     = (known after apply)
      ~ arn                                   = "arn:aws:rds:eu-west-1:480391725083:cluster:raffaelesollecitowebsite-serverless-wordpress" -> (known after apply)
      ~ availability_zones                    = [
          - "eu-west-1a",
          - "eu-west-1b",
          - "eu-west-1c",
        ] -> (known after apply)
      - backtrack_window                      = 0 -> null
      + ca_certificate_identifier             = (known after apply)
      + ca_certificate_valid_till             = (known after apply)
      + cluster_identifier_prefix             = (known after apply)
      ~ cluster_members                       = [
          - "raffaelesollecitowebsite-serverless-wordpress-instance-1",
        ] -> (known after apply)
      ~ cluster_resource_id                   = "cluster-VRWTCTUE7J2I67NTDMD5ZSCDFI" -> (known after apply)
      + cluster_scalability_type              = (known after apply)
      ~ database_insights_mode                = "standard" -> (known after apply)
      ~ db_cluster_parameter_group_name       = "default.aurora-mysql8.0" -> (known after apply)
      + db_system_id                          = (known after apply)
      - deletion_protection                   = false -> null
      + enable_local_write_forwarding         = false
      - enabled_cloudwatch_logs_exports       = [] -> null
      ~ endpoint                              = "raffaelesollecitowebsite-serverless-wordpress.cluster-c7bcrlikhhvy.eu-west-1.rds.amazonaws.com" -> (known after apply)
      ~ engine_lifecycle_support              = "open-source-rds-extended-support" -> (known after apply)
      ~ engine_mode                           = "provisioned" -> "serverless" # forces replacement
      ~ engine_version                        = "8.0.mysql_aurora.3.08.2" -> "5.7.mysql_aurora.2.07.1"
      ~ engine_version_actual                 = "8.0.mysql_aurora.3.08.2" -> (known after apply)
      ~ hosted_zone_id                        = "Z29XKXDKYMONMX" -> (known after apply)
      ~ iam_roles                             = [] -> (known after apply)
      ~ id                                    = "raffaelesollecitowebsite-serverless-wordpress" -> (known after apply)
      - iops                                  = 0 -> null
      ~ kms_key_id                            = "arn:aws:kms:eu-west-1:480391725083:key/55ea2074-47b4-4d13-83fb-2d33b35707e0" -> (known after apply)
      ~ master_user_secret                    = [] -> (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      ~ monitoring_interval                   = 0 -> (known after apply)
      + monitoring_role_arn                   = (known after apply)
      ~ network_type                          = "IPV4" -> (known after apply)
      - performance_insights_enabled          = false -> null
      + performance_insights_kms_key_id       = (known after apply)
      ~ performance_insights_retention_period = 0 -> (known after apply)
      ~ port                                  = 3306 -> (known after apply)
      ~ preferred_backup_window               = "02:45-03:15" -> (known after apply)
      ~ preferred_maintenance_window          = "sat:04:23-sat:04:53" -> (known after apply)
      ~ reader_endpoint                       = "raffaelesollecitowebsite-serverless-wordpress.cluster-ro-c7bcrlikhhvy.eu-west-1.rds.amazonaws.com" -> (known after apply)
      + storage_type                          = (known after apply)
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
        # (16 unchanged attributes hidden)

      + scaling_configuration {
          + auto_pause               = true
          + max_capacity             = 1
          + min_capacity             = 1
          + seconds_before_timeout   = 300
          + seconds_until_auto_pause = 300
          + timeout_action           = "ForceApplyCapacityChange"
        }

      - serverlessv2_scaling_configuration {
          - max_capacity             = 1 -> null
          - min_capacity             = 0 -> null
          - seconds_until_auto_pause = 300 -> null
        }
    }

  # module.cloudfront.aws_cloudfront_distribution.wordpress_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "wordpress_distribution" {
        id                             = "E1QA011ASCYU5O"
        tags                           = {}
        # (21 unchanged attributes hidden)

      ~ default_cache_behavior {
          + cache_policy_id        = "658327ea-f89d-4fab-a63d-7e88639e58f6"
            # (11 unchanged attributes hidden)

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }

          + function_association {
              + event_type   = "viewer-request"
              + function_arn = (known after apply)
            }

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:480391725083:function:raffaelesollecitowebsite_redirect_index_html:8" -> null
            }

            # (1 unchanged block hidden)
        }

      - origin {
          - connection_attempts = 3 -> null
          - connection_timeout  = 10 -> null
          - domain_name         = "www.raffaelesollecito.org.s3.eu-west-1.amazonaws.com" -> null
          - origin_id           = "raffaelesollecitowebsite_WordpressBucket" -> null

          - s3_origin_config {
              - origin_access_identity = "origin-access-identity/cloudfront/E20QCT551PFTEX" -> null
            }
        }
      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "www.raffaelesollecito.org.s3.eu-west-1.amazonaws.com"
          + origin_access_control_id = (known after apply)
          + origin_id                = "raffaelesollecitowebsite_WordpressBucket"
        }

        # (2 unchanged blocks hidden)
    }

  # module.cloudfront.aws_cloudfront_function.url_rewrite will be created
  + resource "aws_cloudfront_function" "url_rewrite" {
      + arn             = (known after apply)
      + code            = <<-EOT
            // CloudFront Function: rewrite directory requests to index.html
            // Replaces the legacy Lambda@Edge origin-request function.
            //
            // Handles:
            //   /path/          → /path/index.html
            //   /path/index.php → /path/index.html
            //   /path           → /path/index.html  (no extension = directory)
            
            function handler(event) {
              var request = event.request;
              var uri = request.uri;
            
              if (uri.endsWith('/')) {
                request.uri = uri + 'index.html';
              } else if (uri.endsWith('/index.php')) {
                request.uri = uri.replace(/\/index\.php$/, '/index.html');
              } else if (!uri.includes('.')) {
                request.uri = uri + '/index.html';
              }
            
              return request;
            }
        EOT
      + comment         = "Rewrite directory requests to index.html"
      + etag            = (known after apply)
      + id              = (known after apply)
      + live_stage_etag = (known after apply)
      + name            = "raffaelesollecitowebsite_url_rewrite"
      + publish         = true
      + runtime         = "cloudfront-js-2.0"
      + status          = (known after apply)
    }

  # module.cloudfront.aws_cloudfront_origin_access_control.wordpress_distribution will be created
  + resource "aws_cloudfront_origin_access_control" "wordpress_distribution" {
      + arn                               = (known after apply)
      + description                       = "raffaelesollecitowebsite OAC for S3"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "raffaelesollecitowebsite-oac"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # module.cloudfront.aws_cloudfront_origin_access_identity.wordpress_distribution will be destroyed
  # (because aws_cloudfront_origin_access_identity.wordpress_distribution is not in configuration)
  - resource "aws_cloudfront_origin_access_identity" "wordpress_distribution" {
      - arn                             = "arn:aws:cloudfront::480391725083:origin-access-identity/E20QCT551PFTEX" -> null
      - caller_reference                = "terraform-20220617174738646800000005" -> null
      - cloudfront_access_identity_path = "origin-access-identity/cloudfront/E20QCT551PFTEX" -> null
      - comment                         = "raffaelesollecitowebsite OAI for S3" -> null
      - etag                            = "E2GL424AU8QW5F" -> null
      - iam_arn                         = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E20QCT551PFTEX" -> null
      - id                              = "E20QCT551PFTEX" -> null
      - s3_canonical_user_id            = "8b85616dffd445da225493d17c01009cc0cab0c1d025725dc82a681698e336f48c20a9453037d2ab3b24c83b6fdb935e" -> null
    }

  # module.cloudfront.aws_cloudwatch_log_group.object_redirect will be destroyed
  # (because aws_cloudwatch_log_group.object_redirect is not in configuration)
  - resource "aws_cloudwatch_log_group" "object_redirect" {
      - arn               = "arn:aws:logs:eu-west-1:480391725083:log-group:/aws/lambda/raffaelesollecitowebsite_redirect_index_html" -> null
      - id                = "/aws/lambda/raffaelesollecitowebsite_redirect_index_html" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/raffaelesollecitowebsite_redirect_index_html" -> null
      - retention_in_days = 7 -> null
      - skip_destroy      = false -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # module.cloudfront.aws_cloudwatch_log_group.object_redirect_ue1 will be destroyed
  # (because aws_cloudwatch_log_group.object_redirect_ue1 is not in configuration)
  - resource "aws_cloudwatch_log_group" "object_redirect_ue1" {
      - arn               = "arn:aws:logs:us-east-1:480391725083:log-group:/aws/lambda/us-east-1.raffaelesollecitowebsite_redirect_index_html" -> null
      - id                = "/aws/lambda/us-east-1.raffaelesollecitowebsite_redirect_index_html" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/us-east-1.raffaelesollecitowebsite_redirect_index_html" -> null
      - retention_in_days = 7 -> null
      - skip_destroy      = false -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # module.cloudfront.aws_cloudwatch_log_group.object_redirect_ue1_local will be destroyed
  # (because aws_cloudwatch_log_group.object_redirect_ue1_local is not in configuration)
  - resource "aws_cloudwatch_log_group" "object_redirect_ue1_local" {
      - arn               = "arn:aws:logs:eu-west-1:480391725083:log-group:/aws/lambda/us-east-1.raffaelesollecitowebsite_redirect_index_html" -> null
      - id                = "/aws/lambda/us-east-1.raffaelesollecitowebsite_redirect_index_html" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/us-east-1.raffaelesollecitowebsite_redirect_index_html" -> null
      - retention_in_days = 7 -> null
      - skip_destroy      = false -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # module.cloudfront.aws_iam_role.lambda-edge will be destroyed
  # (because aws_iam_role.lambda-edge is not in configuration)
  - resource "aws_iam_role" "lambda-edge" {
      - arn                   = "arn:aws:iam::480391725083:role/raffaelesollecitowebsite-lambda-edge-service-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = [
                              - "edgelambda.amazonaws.com",
                              - "lambda.amazonaws.com",
                            ]
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-06-17T17:47:39Z" -> null
      - force_detach_policies = false -> null
      - id                    = "raffaelesollecitowebsite-lambda-edge-service-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "raffaelesollecitowebsite-lambda-edge-service-role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAW7WMUAAN2X7KF6L75" -> null

      - inline_policy {
          - name   = "raffaelesollecitowebsite-lambda-edge-cloudwatch-logs" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:PutLogEvents",
                              - "logs:CreateLogStream",
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:logs:*:*:*"
                          - Sid      = ""
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.cloudfront.aws_iam_role_policy.lambda-edge-cloudwatch-logs will be destroyed
  # (because aws_iam_role_policy.lambda-edge-cloudwatch-logs is not in configuration)
  - resource "aws_iam_role_policy" "lambda-edge-cloudwatch-logs" {
      - id     = "raffaelesollecitowebsite-lambda-edge-service-role:raffaelesollecitowebsite-lambda-edge-cloudwatch-logs" -> null
      - name   = "raffaelesollecitowebsite-lambda-edge-cloudwatch-logs" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:*:*:*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "raffaelesollecitowebsite-lambda-edge-service-role" -> null
    }

  # module.cloudfront.aws_iam_role_policy_attachment.basic will be destroyed
  # (because aws_iam_role_policy_attachment.basic is not in configuration)
  - resource "aws_iam_role_policy_attachment" "basic" {
      - id         = "raffaelesollecitowebsite-lambda-edge-service-role-20220617174741561300000006" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole" -> null
      - role       = "raffaelesollecitowebsite-lambda-edge-service-role" -> null
    }

  # module.cloudfront.aws_lambda_function.object_redirect will be destroyed
  # (because aws_lambda_function.object_redirect is not in configuration)
  - resource "aws_lambda_function" "object_redirect" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-1:480391725083:function:raffaelesollecitowebsite_redirect_index_html" -> null
      - code_sha256                    = "jaYQ8SWhvwPriB2hYccrNtBtoleT28asmBw+hHU2WZk=" -> null
      - filename                       = "modules/cloudfront/lambda_redirect/dst/index_html.zip" -> null
      - function_name                  = "raffaelesollecitowebsite_redirect_index_html" -> null
      - handler                        = "index.handler" -> null
      - id                             = "raffaelesollecitowebsite_redirect_index_html" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:480391725083:function:raffaelesollecitowebsite_redirect_index_html/invocations" -> null
      - last_modified                  = "2022-06-17T17:47:46.447+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = true -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-1:480391725083:function:raffaelesollecitowebsite_redirect_index_html:8" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:480391725083:function:raffaelesollecitowebsite_redirect_index_html:8/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::480391725083:role/raffaelesollecitowebsite-lambda-edge-service-role" -> null
      - runtime                        = "nodejs12.x" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "jaYQ8SWhvwPriB2hYccrNtBtoleT28asmBw+hHU2WZk=" -> null
      - source_code_size               = 744 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 3 -> null
      - version                        = "8" -> null

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format = "Text" -> null
          - log_group  = "/aws/lambda/raffaelesollecitowebsite_redirect_index_html" -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.cloudfront.aws_s3_bucket_policy.wordpress_bucket will be updated in-place
  ~ resource "aws_s3_bucket_policy" "wordpress_bucket" {
        id     = "www.raffaelesollecito.org"
      ~ policy = jsonencode(
          ~ {
              - Id        = "PolicyForCloudFrontPrivateContent"
              ~ Statement = [
                  ~ {
                      + Condition = {
                          + StringEquals = {
                              + "AWS:SourceArn" = "arn:aws:cloudfront::480391725083:distribution/E1QA011ASCYU5O"
                            }
                        }
                      ~ Principal = {
                          - AWS     = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E20QCT551PFTEX"
                          + Service = "cloudfront.amazonaws.com"
                        }
                      ~ Sid       = "1" -> "AllowCloudFrontServicePrincipal"
                        # (3 unchanged attributes hidden)
                    },
                ]
              ~ Version   = "2008-10-17" -> "2012-10-17"
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.cloudfront.aws_s3_bucket_server_side_encryption_configuration.wordpress_bucket will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "wordpress_bucket" {
      + bucket = "www.raffaelesollecito.org"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.codebuild.data.archive_file.code_build_package will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "code_build_package" {
      + excludes            = [
          + "wordpress_docker.zip",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/codebuild/codebuild_files/wordpress_docker.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "modules/codebuild/codebuild_files/"
      + type                = "zip"
    }

  # module.codebuild.aws_codebuild_project.wordpress_docker_build will be updated in-place
  ~ resource "aws_codebuild_project" "wordpress_docker_build" {
        id                     = "arn:aws:codebuild:eu-west-1:480391725083:project/raffaelesollecitowebsite-serverless-wordpress-docker-build"
        name                   = "raffaelesollecitowebsite-serverless-wordpress-docker-build"
        tags                   = {}
        # (10 unchanged attributes hidden)

      ~ source {
          ~ location            = "raffaelesollecitowebsite-build/wordpress_docker.zip" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.codebuild.aws_s3_bucket_object.wordpress_dockerbuild will be destroyed
  # (because aws_s3_bucket_object.wordpress_dockerbuild is not in configuration)
  - resource "aws_s3_bucket_object" "wordpress_dockerbuild" {
      - acl                    = "private" -> null
      - arn                    = "arn:aws:s3:::raffaelesollecitowebsite-build/wordpress_docker.zip" -> null
      - bucket                 = "raffaelesollecitowebsite-build" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "binary/octet-stream" -> null
      - etag                   = "5a8bda34899097316fd956643fcc340d" -> null
      - force_destroy          = false -> null
      - id                     = "wordpress_docker.zip" -> null
      - key                    = "wordpress_docker.zip" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "modules/codebuild/codebuild_files/wordpress_docker.zip" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # module.codebuild.aws_s3_bucket_server_side_encryption_configuration.code_source will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "code_source" {
      + bucket = "raffaelesollecitowebsite-build"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.codebuild.aws_s3_object.wordpress_dockerbuild will be created
  + resource "aws_s3_object" "wordpress_dockerbuild" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "raffaelesollecitowebsite-build"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "wordpress_docker.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "modules/codebuild/codebuild_files/wordpress_docker.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.codebuild.local_file.php_ini will be created
  + resource "local_file" "php_ini" {
      + content              = <<-EOT
            upload_max_filesize=64M
            post_max_size=64M
            max_execution_time=0
            max_input_vars=2000
            memory_limit=512M
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "modules/codebuild/codebuild_files/php.ini"
      + id                   = (known after apply)
    }

Plan: 9 to add, 5 to change, 11 to destroy.

Changes to Outputs:
  ~ codebuild_package_etag   = "5a8bda34899097316fd956643fcc340d" -> (known after apply)

```
</details>